{"id":"NFLX_Q4FY2025_no_uncertainty_01","doc_type":"earnings_call","firm":"NFLX","fiscal_quarter":"Q4 FY 2025","label":"no_uncertainty","label_desc":"No uncertainty: This examples show forward looking behaviour that do not carry uncertainty.","text":"But viewing on the second-run titles was lower year-over-year because the volume of licensed titles that we're carrying came down across most regions. And that's due largely to the fact that we stepped up our licensing in 2023 and 2024 during the strikes, which had shut down new productions. So that's balancing out that volume right now. But beyond view hours then, as you stated, all hours of engagement are not the same. And we really care about the quality of that engagement. For example, we said in the letter, you know, live programming is an example where, you know, any given hour of entertainment has the potential to deliver outsized value. That's certainly also the case when you have a huge fan of a particular series or a movie. And we, as viewers, we feel this intuitively, right?","source":"NFLX Q4 FY 2025"}
{"id":"NFLX_Q4FY2025_no_uncertainty_02","doc_type":"earnings_call","firm":"NFLX","fiscal_quarter":"Q4 FY 2025","label":"no_uncertainty","label_desc":"No uncertainty: This examples show forward looking behaviour that do not carry uncertainty.","text":"Putting maybe a little bit more meat on that bone, in 2025, we met or exceeded all of our financial objectives. We made solid progress on our key priorities. We delivered 16% revenue growth, roughly 30% operating profit growth, expanding margins, growing key free cash flow. Ad sales two and a half times in 2025. We expect that business to roughly double again in 2026 to about $3 billion. So we're making good progress, and the opportunity ahead of us is massive. We are still under 10% of TV time in all major markets which we compete. We've got hundreds of millions of households around the world still to sign up. We're just about 7% of the addressable market in terms of consumer and ad spend. So tons of room ahead of us.","source":"NFLX Q4 FY 2025"}
{"id":"NFLX_Q4FY2025_no_uncertainty_03","doc_type":"earnings_call","firm":"NFLX","fiscal_quarter":"Q4 FY 2025","label":"no_uncertainty","label_desc":"No uncertainty: This examples show forward looking behaviour that do not carry uncertainty.","text":"we're very excited about the business. We're very excited about the organic opportunity ahead. We see that in our performance. And we're as energized as ever to achieve our mission to entertain the world.","source":"NFLX Q4 FY 2025"}
{"id":"NFLX_Q4FY2025_no_uncertainty_04","doc_type":"earnings_call","firm":"NFLX","fiscal_quarter":"Q4 FY 2025","label":"no_uncertainty","label_desc":"No uncertainty: This examples show forward looking behaviour that do not carry uncertainty.","text":"I would say just generally we've got a strong lineup throughout the year. But yeah, Steve, as you noted, you know, in 2025, our slate was heavily back half weighted, and we expect more typical seasonality this year. So still a bit heavier in the back half of 2026 than the front half of 2026. In particular, the fourth quarter is always generally the most packed for us in any given year. But overall, a smoother slate and smoother slate timing this year relative to 2025. So as a result, you should see higher year-over-year content expense growth in the first half of 2026, growing off of that smaller base that we had in the first half of last year. But for the full year, we're estimating, as you see in our letter, content amortization to increase roughly 10% year-over-year.","source":"NFLX Q4 FY 2025"}
{"id":"NFLX_Q4FY2025_no_uncertainty_05","doc_type":"earnings_call","firm":"NFLX","fiscal_quarter":"Q4 FY 2025","label":"no_uncertainty","label_desc":"No uncertainty: This examples show forward looking behaviour that do not carry uncertainty.","text":"Rich, we've actually been testing vertical video features for some time, about six months or so. We've had a vertical video feed in the mobile experience that's been available for several months. That feed is filled with clips of Netflix shows and movies. You can imagine us bringing more clips based on new content types like video podcasts, which Ted mentioned that we're adding to the general service. We'll bring the, you know, sort of appropriate components of that into that vertical video feed. Really, this is part of a broader upgrade of our mobile experience. Just as you've seen us do with the new TV UI, we're working on a new mobile UI that will better serve the expansion of our business over the decade to come. We're going to roll this out later in 2026.","source":"NFLX Q4 FY 2025"}
{"id":"AAPL_Q4FY2025_no_uncertainty_01","doc_type":"earnings_call","firm":"AAPL","fiscal_quarter":"Q4 FY 2025","label":"no_uncertainty","label_desc":"No uncertainty: This examples show forward looking behaviour that do not carry uncertainty.","text":"Thank you, Suhasini. Good afternoon, everyone, and thanks for joining the call. Today, Apple Inc. is proud to report $102.5 billion in revenue, up 8% from a year ago and a September quarter record. Services achieved an all-time revenue record of $28.8 billion, growing 15% from a year ago. EPS came in at $1.85, setting a September quarter record. We grew in the vast majority of markets we track and had September quarter revenue records in dozens of markets, including the U.S., Canada, Latin America, Western Europe, the Middle East, Japan, Korea, and South Asia. We also set a September quarter revenue record in emerging markets and an all-time revenue record in India. These results come at the close of an extraordinary year for Apple Inc., in which we achieved an all-time revenue record of $416 billion for the fiscal year.","source":"APPL Q4 FY 2025"}
{"id":"AAPL_Q4FY2025_no_uncertainty_02","doc_type":"earnings_call","firm":"AAPL","fiscal_quarter":"Q4 FY 2025","label":"no_uncertainty","label_desc":"No uncertainty: This examples show forward looking behaviour that do not carry uncertainty.","text":"We set all-time revenue records in emerging and developed markets. We set an all-time revenue record for iPhone. In services, we achieved all-time records across every geographic segment. These results reflect the tremendous customer enthusiasm for Apple Inc. products and services, as well as our deep commitment to innovation. We are incredibly excited about the strength we're seeing across our products and services, and we expect the December quarter's revenue to be the best ever for the company and the best ever for iPhone. We are heading into the holiday season with a truly remarkable lineup that includes the biggest leap ever for iPhone, which has had a tremendous response from our users around the world. Our Apple Watch lineup is more capable than ever too, giving users ways to take charge of their health like never before through new features like hypertension notifications and sleep score.","source":"APPL Q4 FY 2025"}
{"id":"AAPL_Q4FY2025_no_uncertainty_03","doc_type":"earnings_call","firm":"AAPL","fiscal_quarter":"Q4 FY 2025","label":"no_uncertainty","label_desc":"No uncertainty: This examples show forward looking behaviour that do not carry uncertainty.","text":"The next-level sound quality and active noise cancellation of AirPods Pro 3 are hitting all the right notes for our users. In October, we also broke new ground in power-efficient performance with the uncomparably fast M5 chip, packed with neural accelerators in each GPU core to supercharge AI workloads. iPad Pro combines game-changing features in iPadOS 26 with the power of M5 to create our most capable iPad ever. At the same time, the M5 MacBook Pro raises the bar for what users can do with a laptop, while the new M5-powered Apple Vision Pro opens up amazing possibilities on its infinite canvas. We also launched a beautiful new software design that creates a unified experience across all of our platforms for the very first time. The design is crafted with a new material called Liquid Glass that brings fluidity, vitality, and flexibility to our products.","source":"APPL Q4 FY 2025"}
{"id":"AAPL_Q4FY2025_no_uncertainty_04","doc_type":"earnings_call","firm":"AAPL","fiscal_quarter":"Q4 FY 2025","label":"no_uncertainty","label_desc":"No uncertainty: This examples show forward looking behaviour that do not carry uncertainty.","text":"Along with the new design, we delivered powerful new features to enable users to do even more with their devices. That includes updates to the phone and messages apps in iOS 26 to help users stay connected, continuity enhancements in Mac to deliver an even more seamless experience across devices, and a powerful new windowing system that fundamentally transforms the user experience in iPadOS 26. As we continue to expand our investment in AI, we're bringing intelligence to more of what people already love about our products and services, making every experience even more personal, capable, and effortless. At the heart of it all is Apple Silicon, and we were thrilled to launch new products powered by the A19 Pro chip and M5. These incredibly advanced chips make Apple products the very best place to experience the power of AI.","source":"APPL Q4 FY 2025"}
{"id":"AAPL_Q4FY2025_no_uncertainty_05","doc_type":"earnings_call","firm":"AAPL","fiscal_quarter":"Q4 FY 2025","label":"no_uncertainty","label_desc":"No uncertainty: This examples show forward looking behaviour that do not carry uncertainty.","text":"With Apple Intelligence, we've introduced dozens of new features that are powerful, intuitive, private, and deeply integrated into the things people do every day. Features like live translation, which help users communicate across languages in real time, and visual intelligence, which opens new ways to learn about and explore the world. We also introduced Workout Buddy, a new experience that uses AI to provide personalized motivational insights based on a user's workout data and fitness history. These join so many others, from cleanup in photos and new image creation tools to powerful writing tools. We're also seeing developers take advantage of our on-device foundation models to create entirely new experiences for users around the world. We're also excited for a more personalized Siri. We're making good progress on it, and as we've shared, we expect to release it next year.","source":"APPL Q4 FY 2025"}
{"id":"AAPL_Q4FY2025_no_uncertainty_06","doc_type":"earnings_call","firm":"AAPL","fiscal_quarter":"Q4 FY 2025","label":"no_uncertainty","label_desc":"No uncertainty: This examples show forward looking behaviour that do not carry uncertainty.","text":"Severance topped all dramas with eight wins, adding to the accolades for this landmark series. To date, Apple TV+ productions have now earned over 600 wins and 2,800 nominations in total, driven by powerful, original storytelling. We're excited for audiences to discover new productions like Pluribus and to catch returning favorites like Slow Horses and The Morning Show. Soon, Apple TV+ will be the destination for F1 fans across the U.S. on track day, thanks to a new partnership with Formula One. F1 is one of the most exciting and fastest-growing sports in the world, and starting next year, Apple TV+ will be the place for subscribers to follow every twist and turn of the new season. In addition, F1: The Movie, one of the year's biggest blockbusters, will be coming to Apple TV+ on December 12th. During the September quarter, we also marked the 10-year anniversary of Apple News.","source":"APPL Q4 FY 2025"}
{"id":"AAPL_Q4FY2025_no_uncertainty_07","doc_type":"earnings_call","firm":"AAPL","fiscal_quarter":"Q4 FY 2025","label":"no_uncertainty","label_desc":"No uncertainty: This examples show forward looking behaviour that do not carry uncertainty.","text":"Thanks, Tim, and good afternoon, everyone. Our revenue of $102.5 billion was up 8% year over year and is a new September quarter record. We set September quarter records in the Americas, Europe, Japan, and the rest of Asia-Pacific, and grew in the vast majority of markets we track. Products revenue was $73.7 billion, up 5% year over year, driven by growth across iPhone and Mac, and reached a September quarter record. Thanks to our exceptional customer satisfaction and strong levels of loyalty, our install base of active devices has reached another all-time high across all product categories and geographic segments. Services revenue was $28.8 billion, up 15% year over year, and an all-time record. The performance was broad-based, with double-digit growth in the vast majority of the markets we track and double-digit growth across most of our services categories.","source":"APPL Q4 FY 2025"}
{"id":"AAPL_Q4FY2025_no_uncertainty_08","doc_type":"earnings_call","firm":"AAPL","fiscal_quarter":"Q4 FY 2025","label":"no_uncertainty","label_desc":"No uncertainty: This examples show forward looking behaviour that do not carry uncertainty.","text":"Turning to enterprise, we are seeing an adoption of Apple products accelerate across industries to improve productivity and drive innovation. The BMW Group has been deploying tens of thousands of iPhones, including to factory employees, to further strengthen its digital capabilities and advanced innovation at the company. Capital One has expanded its Mac Choice program by adding thousands more MacBook Airs across its workforce. In the Czech Republic, its largest bank, Česká Spořitelna, continues to invest in the Apple ecosystem with over 5,000 iPhones in addition to its existing thousands of iPads and Macs. Purdue University has launched a spatial computing hub built around Apple Vision Pro, designed to help prepare students to lead the next wave of innovation in critical industries like semiconductor and pharmaceutical manufacturing. Let's turn to our cash position and capital return program. We ended the quarter with $132 billion in cash and marketable securities.","source":"APPL Q4 FY 2025"}
{"id":"NFLX_Q4FY2025_intermediate_uncertainty_01","doc_type":"earnings_call","firm":"NFLX","fiscal_quarter":"Q4 FY 2025","label":"intermediate_uncertainty","label_desc":"Intermediate Uncertainty: Examples that carry some uncertainty.","text":"Sure. We find it useful to talk internally about our long-term aspirations, which, as we said at the time that this was reported last year, aren't the same as a forecast. But having said that, those goals were based on organic progress. They did not contemplate or assume any M&A because we didn't have any M&A on sort of our horizon at the time. And over the last nine months, we've seen continued growth. We are now forecasting more healthy growth for the year to come, specifically organic growth. Of course, there's a lot of hard work ahead to fully realize those opportunities, both short-term and long-term. But based on the progress that we've made so far and expect to make and our continuing assessment of the opportunity, we still feel good about those targets.","source":"NFLX Q4 FY 2025"}
{"id":"NFLX_Q4FY2025_intermediate_uncertainty_02","doc_type":"earnings_call","firm":"NFLX","fiscal_quarter":"Q4 FY 2025","label":"intermediate_uncertainty","label_desc":"Intermediate Uncertainty: Examples that carry some uncertainty.","text":"looking ahead to 2026, we're focused on improving the core business. You know, and we do that by increasing the variety and quality of our series and films. We do that by enhancing the product experience and by growing and strengthening our ad business. We're also building out some newer initiatives, you know, like our live outside of the US, things like the World Baseball Classic in Japan. It's launching in March. We're expanding into more content categories like video podcast, which just kicked us off this week. And we're continuing to scale our cloud-first game strategy. We're working really hard to close the acquisition of Warner Bros. Studios and HBO, which we see as a strategic accelerant. And we're doing all this while we're driving and sustaining healthy growth. We forecast 2026 revenue at $51 billion, which is up 14% year on year.","source":"NFLX Q4 FY 2025"}
{"id":"NFLX_Q4FY2025_intermediate_uncertainty_03","doc_type":"earnings_call","firm":"NFLX","fiscal_quarter":"Q4 FY 2025","label":"intermediate_uncertainty","label_desc":"Intermediate Uncertainty: Examples that carry some uncertainty.","text":"Yeah, so there is still a gap between the ad-tier ARM and ARM for standard without ads, but that gap is narrowing. And while because there's a gap, it means we're underrealizing revenue growth in the near time, it also therefore represents an opportunity for us. So as we improve our ads capabilities, we can close that gap over time. We can drive more revenue. We've seen exactly that ability to do that over the last year. So we've expanded demand sources. We continue to prove our speed of execution on our own ad tech stack. That's more ad features, ads products, more measurement, et cetera. That means, you know, increased fill rates, and that's driven ads ARM higher. So now that we've grown to relevant scale, meaning consumer reach in all our ads countries, our main focus is on increasing the monetization of that growing inventory.","source":"NFLX Q4 FY 2025"}
{"id":"NFLX_Q4FY2025_intermediate_uncertainty_04","doc_type":"earnings_call","firm":"NFLX","fiscal_quarter":"Q4 FY 2025","label":"intermediate_uncertainty","label_desc":"Intermediate Uncertainty: Examples that carry some uncertainty.","text":"We've seen some really positive results with games like Red Dead Redemption, same kind of performance that we saw in GTA for folks that are familiar with that. We're also excited about more kids, more narrative feature releases in 2026, so those are good areas of growth for us, but a big advancement, as you sort of alluded to, Spencer, and a big priority for us is our cloud-based TV games. It's an exciting launch for us. We're still in the early stages of this rollout. Roughly a third of our members have access to TV-based games. This is sort of a process of upgrading the TV technology, the TV clients to be able to handle that, and recently, with our party games on TV, Boggle, as you mentioned, Pictionary, LEGO party games like that, we've seen, you know, really strong uptake.","source":"NFLX Q4 FY 2025"}
{"id":"NFLX_Q4FY2025_intermediate_uncertainty_05","doc_type":"earnings_call","firm":"NFLX","fiscal_quarter":"Q4 FY 2025","label":"intermediate_uncertainty","label_desc":"Intermediate Uncertainty: Examples that carry some uncertainty.","text":"It's off a small base because about, I think, about 10% reach into those eligible members. Our TV-based games have enjoyed quite a significant engagement uptick after that party pack launch. In 2026, this year, we're going to be expanding that cloud-first strategy. We've got a growing set of cloud games to the TV, like our recently announced newly reimagined, more accessible FIFA football simulation game. We're super excited to be able to launch that. Stepping back for a second, if you look at that in totality, why is this important? You know, as we've said in the past, it's a big market, you know, roughly $140 billion worth of consumer spend ex-China. We are just scratching the surface today in terms of what we can do in this space.","source":"NFLX Q4 FY 2025"}
{"id":"NFLX_Q4FY2025_intermediate_uncertainty_06","doc_type":"earnings_call","firm":"NFLX","fiscal_quarter":"Q4 FY 2025","label":"intermediate_uncertainty","label_desc":"Intermediate Uncertainty: Examples that carry some uncertainty.","text":"But we already are seeing, you know, multiple instances of how this approach not only extends the audience's engagement with the service and with the story, but it also creates synergy that reinforces both mediums. So the interactive and the non-interactive side, that drives more engagement, more retention. So, you know, bottom line, we're very bullish on the opportunity side. We're seeing progress. We've still got a lot of work to go do. And I should say, like all of our developing initiatives, we're going to ramp our investment based on demonstrated value to members and returns to the business.","source":"NFLX Q4 FY 2025"}
{"id":"AAPL_Q4FY2025_intermediate_uncertainty_01","doc_type":"earnings_call","firm":"AAPL","fiscal_quarter":"Q4 FY 2025","label":"intermediate_uncertainty","label_desc":"Intermediate Uncertainty: Examples that carry some uncertainty.","text":"We did set a September quarter record for upgraders, and it was a great quarter from that point of view. It's really too early in the cycle on 17 to make any comments about upgraders or switchers. In terms of channel inventory, we ended the quarter toward the low end of the targeted range, obviously because we had constraints on several models of the 16 and the 17. For complete transparency and clarity, we're constrained today on several models of the iPhone 17. There's not a ramp issue. We just have very strong demand, and we're working very hard to fulfill all the orders that we have.","source":"APPL Q4 FY 2025"}
{"id":"AAPL_Q4FY2025_intermediate_uncertainty_02","doc_type":"earnings_call","firm":"AAPL","fiscal_quarter":"Q4 FY 2025","label":"intermediate_uncertainty","label_desc":"Intermediate Uncertainty: Examples that carry some uncertainty.","text":"Yeah. The Greater China revenue was down 4% year over year in the September quarter. It was driven by iPhone. If you look at the iPhone, the majority of the sequential year-over-year change was due to supply constraints that I mentioned earlier. It was basically supply constraints that drove the results. We're thrilled with what we're seeing right now, with traffic being up significantly year over year and the reception of the iPhone 17 family. We expect to return to growth this quarter.","source":"APPL Q4 FY 2025"}
{"id":"AAPL_Q4FY2025_uncertainty_01","doc_type":"earnings_call","firm":"AAPL","fiscal_quarter":"Q4 FY 2025","label":"uncertainty","label_desc":"Uncertainty: Examples that are clearly uncertainty.","text":"As we move ahead into the December quarter, I'd like to review our outlook, which includes the types of forward-looking information Suhasini referred to. Importantly, the color we're providing assumes that the global tariff rates, policies, and application remain in effect as of this call, and the global macroeconomic outlook does not worsen from today. We expect our December quarter total company revenue to grow by 10% to 12% year over year, which would be our best quarter ever. We expect iPhone revenue to grow double digits year over year, which would be our best iPhone quarter ever. On Mac, keep in mind we expect to face a very difficult compare against the M4 MacBook Pro, Mac Mini, and iMac launches in the year-ago quarter. We expect services revenue to grow at a year-over-year rate similar to what we reported in the fiscal year 2025","source":"APPL Q4 FY 2025"}
{"id":"AAPL_Q4FY2025_uncertainty_02","doc_type":"earnings_call","firm":"AAPL","fiscal_quarter":"Q4 FY 2025","label":"uncertainty","label_desc":"Uncertainty: Examples that are clearly uncertainty.","text":"David, I'll take this one. You're right. It goes from $1.1 billion to a projection of $1.4 billion. The $1.4 billion is based on what we know right now and where the tariff rates and policies are. It assumes a stable kind of environment for the quarter. It does comprehend the change that was just made, which we're very encouraged to see, with the tariffs moving from 20% to 10% in China. That is factored in, and that is one of the reasons why it's not linear to volume, if you will. Does that make sense?","source":"APPL Q4 FY 2025"}
{"id":"AAPL_Q4FY2025_uncertainty_03","doc_type":"earnings_call","firm":"AAPL","fiscal_quarter":"Q4 FY 2025","label":"uncertainty","label_desc":"Uncertainty: Examples that are clearly uncertainty.","text":"It's really too early to call the mix, to be honest. We don't like to publicly disclose that for competitive reasons. Frankly, we don't really know what the mix will be yet because we have constraints on both sides of the ledger, at the top and at the entry. We'll see what happens as we get more supply.","source":"APPL Q4 FY 2025"}
{"id":"AAPL_Q4FY2025_uncertainty_04","doc_type":"earnings_call","firm":"AAPL","fiscal_quarter":"Q4 FY 2025","label":"uncertainty","label_desc":"Uncertainty: Examples that are clearly uncertainty.","text":"I think that there are many factors that influence people's purchasing considerations. We don't have a great in-depth survey yet on the current iPhone 17 because it's very new in the cycle, and we give it some time to formulate. I would say that Apple Intelligence is a factor, and we're very bullish on it becoming a greater factor. That's the way that we look at it.","source":"APPL Q4 FY 2025"}
{"id":"AAPL_Q2FY2025_uncertainty_01","doc_type":"earnings_call","firm":"AAPL","fiscal_quarter":"Q2 FY 2025","label":"uncertainty","label_desc":"Uncertainty: Examples that are clearly uncertainty.","text":"For the March quarter, we had a limited impact from tariffs as we were able to optimize our supply chain and inventory. For the June quarter, currently, we are not able to precisely estimate the impact of tariffs as we are uncertain of potential future actions prior to the end of the quarter.","source":"APPL Q2 FY 2025"}
{"id":"AAPL_Q2FY2025_uncertainty_02","doc_type":"earnings_call","firm":"AAPL","fiscal_quarter":"Q2 FY 2025","label":"uncertainty","label_desc":"Uncertainty: Examples that are clearly uncertainty.","text":"I don’t want to predict the future because I’m not sure what will happen with the tariffs, and there is the Section 232 investigation going on. And so, it’s very difficult to predict beyond June.","source":"APPL Q2 FY 2025"}
{"id":"JPM_Q4FY2025_uncertainty_01","doc_type":"earnings_call","firm":"JPM","fiscal_quarter":"Q4 FY 2025","label":"uncertainty","label_desc":"Uncertainty: Examples that are clearly uncertainty.","text":"Yeah. So I mean, I'll answer the question, but I think when you're guessing what the macro environment is going to be, if you asked me in the short run, call it six months and nine months and even a year, it's pretty positive. Consumers have money. There's still jobs, even though it's weakened a little bit. There's a lot of stimulus coming from the one big beautiful bill. Deregulation is a plus in general, not just for banks, but banks will be able to redeploy capital. But the backdrop is also important, but the timetables are different. Geopolitical is an enormous amount of risk. And I don't have to go through each part of it. It's just a big amount of risk that may or may not be determining the fate of the economy.","source":"JP Morgan Chase Q4 FY 2025 (Jan 2026)"}
